# Filtering and Ordering - Lab

## Introduction
In this lab, you will write more `SELECT` statements to solidify your ability to query a SQL database. You will also write more specific queries using the tools you learned in the previous lesson.

## Objectives
You will be able to:
* Write SQL queries to filter and order results
* Order the results of your queries by using `ORDER BY` (`ASC` & `DESC`)
* Limit the number of records returned by a query using `LIMIT`
* Filter results using `BETWEEN` and `IS NULL`

### Famous Dogs

Here's a database full of famous dogs!  The `dogs` table is populated with the following data:

|name      |age    |gender |breed           |temperament|hungry |
|----------|-------|-------|----------------|-----------|-------|
|Snoopy    |3      |M      |beagle          |friendly   |1      |
|McGruff   |10     |M      |bloodhound      |aware      |0      |
|Scooby    |6      |M      |great dane      |hungry     |1      |
|Little Ann|5      |F      |coonhound       |loyal      |0      |
|Pickles   |13     |F      |black lab       |mischievous|1      |
|Clifford  |4      |M      |big red         |smiley     |1      |
|Lassie    |7      |F      |collie          |loving     |1      |
|Snowy     |8      |F      |fox terrier     |adventurous|0      |
|NULL      |4      |M      |golden retriever|playful    |1      |

## Connecting to the Database

First, import sqlite3 and establish a connection to the database **dogs.db**. Then, create a cursor object so that you can pass SQL queries to the database.

In [3]:
#Your code here; import sqlite, create a connection and then a cursor object.
import sqlite3 
import pandas as pd
conn = sqlite3.connect('dogs.db')
cur = conn.cursor()
cur.execute("""SELECT * FROM dogs;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head(10)

   id        name  age gender             breed  temperament  hungry
0   1      Snoopy    3      M            beagle     friendly       1
1   2     McGruff   10      M        bloodhound        aware       0
2   3      Scooby    6      M        great dane       hungry       1
3   4  Little Ann    5      F         coonhound        loyal       0
4   5     Pickles   13      F         black lab  mischievous       1
5   6    Clifford    4      M           big red       smiley       1
6   7      Lassie    7      F            collie       loving       1
7   8       Snowy    8      F       fox terrier  adventurous       0
8   9        None    4      M  golden retriever      playful       1

## Queries

Display the outputs for each of the following query descriptions.

### Select the name and breed for all female dogs

In [8]:
#Your code here
cur.execute('''SELECT name, breed FROM dogs WHERE (gender = 'F');''').fetchall()

[('Little Ann', 'coonhound'),
 ('Pickles', 'black lab'),
 ('Lassie', 'collie'),
 ('Snowy', 'fox terrier')]

### Select the names of all dogs listed in alphabetical order.  Notice that SQL lists the nameless dog first.

In [12]:
#Your code here
cur.execute("""SELECT name
               FROM dogs
               ORDER BY name
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

         name
0        None
1    Clifford
2      Lassie
3  Little Ann
4     McGruff
5     Pickles
6      Scooby
7      Snoopy
8       Snowy

### Select any dog that doesn't have a name

In [16]:
#Your code here
cur.execute('''SELECT * FROM dogs WHERE name IS null;''').fetchall()

[(9, None, 4, 'M', 'golden retriever', 'playful', 1)]

### Select the name and breed of only the hungry dogs and list them from youngest to oldest

In [21]:
#Your code here
cur.execute("""SELECT name, breed, hungry, age
               FROM dogs
               WHERE (hungry = 1)
               ORDER BY age
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

       name             breed  hungry  age
0    Snoopy            beagle       1    3
1  Clifford           big red       1    4
2      None  golden retriever       1    4
3    Scooby        great dane       1    6
4    Lassie            collie       1    7
5   Pickles         black lab       1   13

### Select the oldest dog's name, age, and temperament

In [28]:
#Your code here
cur.execute('''SELECT name, age, temperament FROM dogs ORDER BY age DESC LIMIT 1;''').fetchall()

[('Pickles', 13, 'mischievous')]

### Select the three youngest dogs

In [31]:
#Your code here
cur.execute('''SELECT name, age FROM dogs ORDER BY age LIMIT 3;''').fetchall()

[('Snoopy', 3), ('Clifford', 4), (None, 4)]

### Select the name and breed of the dogs who are between five and ten years old, ordered from oldest to youngest

In [51]:
#Your code here
cur.execute("""SELECT name, breed, age
               FROM dogs
               WHERE (age > 5 AND age < 10)
               ORDER BY age DESC
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

     name        breed  age
0   Snowy  fox terrier    8
1  Lassie       collie    7
2  Scooby   great dane    6

### Select the name, age, and hungry columns for hungry dogs between the ages of two and seven.  This query should also list these dogs in alphabetical order.

In [65]:
#Your code here
cur.execute("""SELECT name, hungry, age
               FROM dogs
               WHERE (age > 2 AND age < 7) AND (hungry = 1)
               ORDER BY name
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

       name  hungry  age
0      None       1    4
1  Clifford       1    4
2    Scooby       1    6
3    Snoopy       1    3

## Summary

Great work! In this lab you practiced writing more complex SQL statements to not only query specific information but also define the quantity and order of your results.